Tekla Open API Reference for Tekla Structures 2025
SeamVisibilityAttributes Properties
The WeldMark.SeamVisibilityAttributes type exposes the following members.
Properties
Name | Description
ShowAngle
 Gets or sets a value indicating whether the seam angle is visible.
ShowContour
 Gets or sets a value indicating whether the seam contour is visible.
ShowEffectiveThroat
 Gets or sets a value indicating whether the seam effective throat is visible.
ShowFinish
 Gets or sets a value indicating whether the seam finish is visible.
ShowLength
 Gets or sets a value indicating whether the seam length is visible.
ShowPitch
 Gets or sets a value indicating whether the seam pitch is visible.
ShowPrefix
 Gets or sets a value indicating whether the seam prefix is visible.
ShowRootOpening
 Gets or sets a value indicating whether the seam root opening is visible.
ShowSize
 Gets or sets a value indicating whether the seam size is visible.
ShowType
 Gets or sets a value indicating whether the seam type is visible.
Top
See Also
Reference
WeldMark.SeamVisibilityAttributes Class
Tekla.Structures.Drawing Namespace